backend/app/controllers/api/v1/microposts_controller.rb

  def index
    microposts = Micropost.includes(:user).order(created_at: :desc)
---
SELECT `microposts`.* FROM `microposts` ORDER BY `microposts`.`created_at` DESC

  def create
    micropost = current_user.microposts.create!(micropost_params)
---
INSERT INTO `microposts` (`user_id`, `content`, `created_at`, `updated_at`) VALUES (2, 'test', '2022-03-19 03:30:01.633621', '2022-03-19 03:30:01.633621')